000010		
000011		  01 CBU-reset-run PIC X(8) 
000012		  	VALUE "CBU00000". 
000013		  01 CBU-initialize PIC X(8) 
000014		  	VALUE "CBU00001". 
000015		  01 CBU-call-test PIC X(8) 
000016		  	VALUE "CBU00002". 
000017		  01 CBU-run PIC X(8)
000018		  	VALUE "CBU00003".
000019		  01 CBU-add-suite PIC X(8) 
000020		  	VALUE "CBU00004".
000021		  01 CBU-add-test PIC X(8) 
000022		  	VALUE "CBU00005".
000023		  01 CBU-suites-run PIC X(8) 
000024		  	VALUE "CBU00006".
000025		  01 CBU-suite-run PIC X(8) 
000026		  	VALUE "CBU00007".
000027		  01 CBU-tests-run PIC X(8) 
000028		  	VALUE "CBU00008".
000029		  01 CBU-test-run PIC X(8) 
000030		  	VALUE "CBU00009".  	
000031		  01 CBU-set-log-file PIC X(8) 
000032		  	VALUE "CBU00011".  	
000033		  01 CBU-add-test-next PIC X(8) 
000034		  	VALUE "CBU00012".  	
000035		  01 CBU-add-assert-succeed PIC X(8)
000036		  	VALUE "CBU00020".
000037		  01 CBU-add-assert-run PIC X(8)
000038		  	VALUE "CBU00025".
000039		  01 CBU-add-assert-failed PIC X(8)
000040		  	VALUE "CBU00030".  	
000041		  01 CBU-add-error PIC X(8)
000042		  	VALUE "CBU00040".   	
000043		  01 CBU-log-assert-succeed PIC X(8)
000044		  	VALUE "CBU00050".
000045		  01 CBU-log-assert-failed PIC X(8)
000046		  	VALUE "CBU00060".
000047		  01 CBU-write-log-line PIC X(8)
000048		  	VALUE "CBU00080".  	  	
000049		  01 CBU-assert-str100-equals PIC X(8)
000050		  	VALUE "CBU00100".
000051		  01 CBU-assert-str-equals PIC X(8)
000052		  	VALUE "CBU00101".  
000053		  01 CBU-assert-nb3-equals PIC X(8)
000054		  	VALUE "CBU00102".  
000055		  01 CBU-display-line PIC X(8)
000056		  	VALUE "CBU00200".    	
000057		  01 CBU-display-suite PIC X(8)
000058		  	VALUE "CBU00300".
000059		  01 CBU-display-res PIC X(8)
000060		  	VALUE "CBU00301".
000061		  01 CBU-assert-equals PIC X(8)
000062		  	VALUE "CBU00103".
000063			
000064		  01 CBU-get-last-index PIC X(8)
000065		  	VALUE "CBU-U001". 