000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   SAMPLE02.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000071 	 01 D PIC 99.
000072 	 COPY SAMPC001.
000073 LINKAGE SECTION.
000074   01 A PIC 99. 
000075   01 B PIC 99.
000076   01 C PIC 99.   
000077   01 RES PIC 99.
000080 PROCEDURE DIVISION USING A B C RES.
000083   CALL SAMPLE01 USING A B D.
000093   COMPUTE RES = D * C.
000094 END PROGRAM SAMPLE02.