000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   TS000001.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000072  COPY CBUC0002.
000073  COPY SAMPC001.
000080  01 A PIC 99.
000081  01 B PIC 99.
000082  01 RES PIC 99.
000083  01 EXPECTED PIC 99.
000084  01 assert-name PIC X(20).
000085  LINKAGE SECTION.
000086    COPY CBUC0001.
000087 PROCEDURE DIVISION USING CBU-ctx.
000100  MOVE 1 TO EXPECTED.
000110  MOVE 3 TO A.
000120  MOVE 2 TO B.
000130  CALL SAMPLE01 USING A B RES.
000140  MOVE "SAMPLE01(3,2)=1" TO assert-name.
000150  CALL CBU-assert-nb3-equals
000160          USING CBU-ctx assert-name EXPECTED RES.
000170*         MOVE 2 TO EXPECTED.
000180*         MOVE 2 TO A.
000190*         MOVE 2 TO B.
000200*  CALL "SAMPLE01" USING A B RES.
000210*  MOVE "SAMPLE01(2,2)=2" TO assert-name.
000220*  CALL CBU-assert-nb3-equals
000230*         USING CBU-ctx assert-name EXPECTED RES.
000240*         MOVE 2 TO EXPECTED.
000250*         MOVE 3 TO A.
000260*         MOVE 3 TO B.
000270*  CALL "SAMPLE01" USING A B RES.
000280*  MOVE "SAMPLE01(3,3)=2" TO assert-name.
000290*  CALL CBU-assert-nb3-equals
000300*         USING CBU-ctx assert-name EXPECTED RES.
000310 END PROGRAM TS000001.
