000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   CTU0S3T1.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000080   COPY CBUC0002.
000081   LINKAGE SECTION.
000082   COPY CBUC0001.
000083 PROCEDURE DIVISION USING CBU-ctx.     
000084    
000090     
000100 END PROGRAM CTU0S3T1.