000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   SAMPLE03.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000071   01 E PIC 99.
000072   01 F PIC 99.
000073   COPY SAMPC001.
000074   COPY SAMPC002.
000075
000076 LINKAGE SECTION.
000077   01 A PIC 99.
000078   01 B PIC 99.
000079   01 C PIC 99.
000080   01 D PIC 99.
000081   01 RES PIC 99.
000082 PROCEDURE DIVISION USING A B C D RES.
000083   CALL SAMPLE01 USING A B E.
000084   DISPLAY E.
000085   CALL SAMPLE02 USING A C B F.
000093   DISPLAY F.
000094   COMPUTE RES = E + A + D.
000095   DISPLAY RES.
000104 END PROGRAM SAMPLE03.
