000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   SUITE003.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000090  	COPY CBUC0002.
000091  	01 str1 PIC X(20).
000092  	01 str2 PIC X(100). 
000093  	01 RES PIC 99.
000095  	COPY CBUC0001.
000096 PROCEDURE DIVISION.   
000097	 INITIALIZE str1 str2.
000098   MOVE "SUITE1" TO str1.
000099   MOVE "DESC SUITE1" TO str2.
000100 	 CALL CBU-initialize USING CBU-ctx. 
000102 	 CALL CBU-add-suite USING CBU-ctx str1 str2.
000103
000104	 INITIALIZE str1 str2.
000105 	 MOVE "TS000001" TO str1.
000106 	 MOVE "TEST1 desc" TO str2.
000108 	 CALL CBU-add-test-next USING CBU-ctx str1 str2.
000109 	 
000110   INITIALIZE str1 str2.
000111 	 MOVE "TS000002" TO str1.
000112 	 MOVE "TEST2 desc" TO str2.
000114 	 CALL CBU-add-test-next USING CBU-ctx str1 str2.
000115
000116   INITIALIZE str1 str2.
000117 	 MOVE "TS000003" TO str1.
000118 	 MOVE "TEST3 desc" TO str2.
000119 	 CALL CBU-add-test-next USING CBU-ctx str1 str2.
000120
000121 	 CALL CBU-run USING CBU-ctx.
000130 END PROGRAM SUITE003.